src/Documents/ПроизводствоПродукции/ПроизводствоПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводствоПродукции</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеМатериалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПроизводствоПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиНоменклатуры
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеМатериалы из РасходныеМатериалы Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаРасходныеМатериалы.Материал;
		Движение.Количество = ТекСтрокаРасходныеМатериалы.Количество;
	КонецЦикла;
	
	Движения.ОстаткиНоменклатуры.Записать();
	Отказ = РегистрыНакопления.ОстаткиНоменклатуры.ЕстьОтрицательныеОстаткиМатериал(ЭтотОбъект.Ссылка, ЭтотОбъект.Дата);

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		НаменованиеПоставщика = ДанныеЗаполнения.НаменованиеПоставщика;
		Договор = ДанныеЗаполнения.Договор;
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Основание = ДанныеЗаполнения.Ссылка;

		Для Каждого ТекСтрокаМатериалы из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = Материалы.Добавить();
			НоваяСтрока.Материал = ТекСтрокаМатериалы.Материал;
			НоваяСтрока.Количество = ТекСтрокаМатериалы.Количество;
			НоваяСтрока.Цена = ТекСтрокаМатериалы.Цена;
			НоваяСтрока.Сумма = ТекСтрокаМатериалы.Сумма;
		КонецЦикла;

		Для Каждого ТекСтрокаРасходныеМатериалы из ДанныеЗаполнения.РасходныеМатериалы Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Расходник = ТекСтрокаРасходныеМатериалы.Расходник;
			НоваяСтрока.Количество = ТекСтрокаРасходныеМатериалы.Количество;
			НоваяСтрока.Цена = ТекСтрокаРасходныеМатериалы.Цена;
			НоваяСтрока.Сумма = ТекСтрокаРасходныеМатериалы.Сумма;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
